{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "art",
    "1": "computer vision",
    "2": "food",
    "3": "games",
    "4": "medicine",
    "5": "microbiome",
    "6": "physics",
    "7": "transformers"
  },
  "initializer_range": 0.02,
  "label2id": {
    "art": 0,
    "computer vision": 1,
    "food": 2,
    "games": 3,
    "medicine": 4,
    "microbiome": 5,
    "physics": 6,
    "transformers": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "use_cache": false,
  "vocab_size": 30522
}
